models/User.php

SELECT * FROM `user` WHERE `username`='admin'
---
    public static function findByUsername($username)
    {
        $users = User::find()->where(['username'=>$username])->one()->toArray();